{
	"tab": [{
			"content": "Tämä on oletusvalinta. Uusi valinta korvaa edellisen valinnan. Seuraava ympyrä tehtiin Ellipsi valinta-työkalulla:",
			"id": "korvaa",
			"name": "Korvaa",
			"figure": [{
				"alt": "Korvaa",
				"src": "/png/circleselection.webp"
			}]
		},
		{
			"content": "Tämä antaa sinun helposti valita kaksi kuvan aluetta jotka eivät liity toisiinsa tai jatkaa nykyistä valintaa. Seuraava valinta tehtiin piirtämällä ympyrä Ellipsi valinta-työkalulla, lisäksi piirtämällä Neliö Suorakulmaisella valinnalla pitäen Ctrl-nappia pohjassa:",
			"id": "lisaa",
			"name": "Lisää",
			"vihje": "Lisätäksesi olemassa olevaan valintaan, pidä Ctrl-nappi pohjassa kun piirrät valinnan.",
			"figure": [{
				"alt": "Lisää",
				"src": "/png/circlesquareselection.webp"
			}]
		},
		{
			"content": "Tämä antaa sinun poistaa osia valinnasta joita et halua mukaan. Tämä antaa sinun tehdä seuraavan kaltaisia valintoja, joka tehtiin ensin piirtämällä ympyrä Ellipsi valinta-työkalulla ja sen jälkeen piirtäen toinen ympyrä sisälle käyttäen oikeaa hiiren nappia:",
			"id": "vahenna",
			"name": "Vähennä",
			"vihje": "Poistaaksesi osia olemassa olevasta valinnasta, pidä Alt-näppäintä alhaalla piirtäessäsi valintaa.",
			"figure": [{
				"alt": "Vähennä",
				"src": "/png/concentriccircleselection.webp"
			}]
		},
		{
			"content": "Tulos on alue jossa kaksi valintaa ovat päällekkäin. Seuraava esimerkki saatiin piirtämällä sama ympyrä ja neliö kuin alhaalla käänteisen tilan kanssa:",
			"id": "leikkaus",
			"name": "Leikkaus",
			"vihje": "Leikkaus toimii pitämällä Alt-näppäin pohjassa ja piirtäen valinta oikealla hiiren näppäimellä.",
			"figure": [{
				"alt": "Leikkaus",
				"src": "/png/intersectselection.webp"
			}]
		},
		{
			"content": "Tämä luo uusia valintoja ja poistaa vanhoja valintoja. Voit näin tehdä seuraavanlaisia valintoja, käyttäen Ellipsi valintaa ja Suorakulmaista valintaa:",
			"id": "kaanteinen",
			"name": "Käänteinen",
			"vihje": "Käänteinen toimii pitämällä Ctrl-näppäin pohjassa ja piirtämällä valinnan oikealla hiiren napilla.",
			"figure": [{
				"alt": "Käänteinen",
				"src": "/png/xorselection.webp"
			}]
		}
	]
}